<template>
  <div >
      <swiper class="swiper" :options="swiperOption">
        <swiper-slide class="text">
            <div class="centent">
             个功成名就的作家，在沙龙上分享自己的作品。

              简单而风趣的自我介绍后，他开始缓缓讲述这部小说。

              书里的主人公是一个叫罗里的年轻人。

              大学毕业以后，他和女朋友搬去了纽约，住在一个废弃工厂的阁楼里。

              他们贫穷，但热爱生活。

              罗里喜欢写作，渴望实现自己的写作梦想。

              但不久他认识到现实，他投出的稿子石沉大海。

              而他还需要靠父亲的救济才能支付房租。

              迫于生计，罗里最后在出版社找了一份工作。

              日复一日，他和女友也渐渐习惯了这样的生活。

              平淡却有属于自己的幸福。

              于是在某个星期五下午，他们在市政厅举行了婚礼。

              婚后罗里和妻子去巴黎度蜜月。

              穿梭在古老的石板路上，在一家中古店里，罗里看中一只皮包。

              复古而又经典的外观，妻子也很喜欢，决定买下来送给罗里。

              稍微擦拭一下，罗里上班就能用。

              蜜月之行总是短暂。回到纽约，生活一切照旧。

              罗里继续尝试写作，但结果都不尽人意。

              在某一个早晨，罗里拿出在巴黎买的皮包准备装东西进去。

              这时，他在这个中古皮包里发现了一份文稿。

              罗里拿出来查看，原来这份文稿是一部小说。

              他从读第一页开始就被吸引住了，忍不住一直看到了最后。

              而读完整个故事，整本小说。

              罗里呆住了，这本无主之作写的太精彩了，他被深深地震撼了。

              夜晚他无法入眠。

              脑海里萦绕着这部书稿里的情节。

              罗里从床上爬起来坐到电脑前。

              鬼使神差般地一字一句将书稿里的文字输入电脑。

              他一个标点都没改，甚至连拼写错误也没有纠正。

              他不知道自己为什么这样做，他只是想要感受那些文字划过他的指尖，闪过他的脑海。他想要知道那是一种什么感觉，当一个作者灵感涌现，写出杰作的感觉，他想要去感受它…

              当天际泛起鱼肚白时，罗里深吸了一口气，他独坐在电脑前，“完成”了这本杰作。

              早上妻子醒来，无意间看到了电脑里这本书的文档。

              妻子读完也被深深感动了。

              但她误以为是丈夫罗里写的，极尽赞美。

              罗里本想解释，告诉妻子真相的。

              但那一刻面对妻子的赞美与鼓励，他没有说出口。

              之后他将小说打印出来，送到了他工作的出版社主编手里，拜托对方帮忙看看。

              对方答应了。

              但是几天，几星期，甚至几个月过去了，依旧杳无音讯。

              就在罗里快要把书的事情忘记了，一天主编找到他，跟他聊起这本书。

              原来主编昨晚才有时间看罗里的书稿，而看完之后也被这本书打动了。

              主编决定出版罗里的书。

              罗里纠结， 犹豫。

              但最后他在出版合同里签上了自己的名字。

              书籍顺利出版，罗里一举成名。

              小说获得了业界一致好评，在商业上也获得了巨大成功。

              一夜之间罗里成为了畅销书作家，纽约文学界的宠儿。

              他出席颁奖晚会，新书签售会，电台采访。

              罗里做出了自己的选择，偷走了别人的作品。

              而在之后，他遇见了一位老人。

              ——这本书真正的主人。

              Part 2

              那是一个干冷晴朗的秋天早晨。

              罗里坐在公园的长椅里正阅读书籍。

              一个老人走过来在他身旁坐下。

              老人跟罗里礼貌地寒暄打招呼后，忽然神秘地凑近罗里说——

              “我有一个故事。一个非常好的故事。我知道你总会听到别人这么说，但我觉得你肯定会喜欢这个的故事。如果我告诉你这个故事，由你来代写的话，那么你可不可以给我点好处呢？”

              罗里笑了笑说，“这并不公平，不是吗？”

              之后他起身准备离开。

              这时老人开口说道：“这个故事讲的是一个人写了本书之后却把它丢失了的故事，直到另一个人捡到了它…”

              听到老人这句话，罗里怔在原地。

              他重新在老人身边坐下。

              这时老人笑了笑，缓缓讲起了故事。

              那是发生在二战结束后，一个刚满18岁的男孩。

              他当兵入伍，却从未上过战场。

              战后他被派驻到巴黎，主要工作是维修战时被炸坏的下水道。

              某天在巴黎的一家咖啡馆，男孩邂逅了一个女孩，并一见钟情。

              她只会一句英语。

              而他只会一句法语。

              即便如此，两个人还是不可救药的相爱了。

              或许快乐的时光总是短暂。

              很快男孩退伍了，即将离开巴黎。

              两个人在火车站依依不舍的告别。

              回到美国，男孩疯狂思念在巴黎的一切，他和女孩在一起时的种种美好。

              于是他做了一个决定，打包好行李，再次回到了巴黎。

              就这样两个人又重新在一起了。

              男孩在英文周报社找到了一份工作，做记者的同时兼顾写作。

              他和女孩也组建起了家庭，很快有了他们自己的女儿。

              那是他生命中最快乐的一段时光。

              只是那时他不自知。

              直到某天噩运降临，他们年幼女孩得了重疾。

              女儿去世了。

              妻子伤心欲绝，从此像变了一个人。

              而男孩亦改变了许多。

              两个人的婚姻因为丧女之痛出现了危机。

              一天他喝得醉醺醺回家，发现她不在家，桌子上只留了一张字条，她回乡下娘家住些时日，她需要独自思考。

              他面对空荡荡的房间，既愤怒又悲痛。

              过了一会，他在打字机前坐下，开始写下他们在巴黎的故事。

              他废寝忘食，文思泉涌。仿佛悲痛给了他力量。

              他无法控制，他也不知道这些灵感来自哪儿。

              文字变成段落，段落变成篇章。

              就这样两周后，他写完这本小说。

              他沉沉地睡了一觉，无梦好眠。

              醒来之后，他收拾好公寓出发去找妻子。

              她在他面前就像一个孩子一样，十分脆弱。

              她让他一个人先回去，她说她还需要些时间。

              他尊重她的决定，并把书稿留给她，希望她能看看。

              那是他们的故事。

              她看了他写的书，几周以后，她回来了。

              她说她想重新开始生活，他十分欣喜。

              但问及妻子书稿在哪里时，她说就在行李箱里，她带回来了。但是他找遍了行李箱也没有找到他的书稿。

              原来，妻子把它遗落在了火车上。

              他声嘶力竭。

              对她开始抱怨。

              那时书稿在他眼里远比她重要。

              那时他根本不知道许多年后，他会为自己过分在乎那些愚蠢的文字而后悔。

              可在当时，这件事让婚姻关系本就脆弱的两个人雪上加霜。

              一度，他们曾经想回到从前。

              但无论他们如何努力，都无法抹掉过去。

              第一次，他有了想离开的冲动，他渴望回家。

              很快，这种愿望越来越强烈。

              最后，他离开了。

              再也没回到巴黎。

              丢了那份书稿后，他再也没有写出过让自己满意的文字。

              也许是怕陷得太深，也许是失去了写作的灵感，总之，后来他停止了写作。

              听到老人讲到这里时，罗里忍不住问道，“那是一种什么样的感觉？”

              老人说，“等等，故事最精彩的部分还没有结束。”

              在这段记忆尘封多年之后。

              当初的年轻人已经年迈。

              一天他在书店里看到了罗里的书，摆在了最显眼的位置。

              他走进了书店，拿起这本书，翻开第一页。

              他知道，那是他的故事，是他被偷走的人生。

              老人对罗里说，“我不知道你是怎么找到我的书的，说实话，我不在乎。我只是觉得你应该知道这个故事背后的故事，以防有人问起。或许，现在你有了下一个故事的素材了。”

              说完，老人离开了公园。

              而罗里坐在长椅上，此时他感觉不到周围的一切，时间仿佛静止了。

              几个小时后，太阳终于下山了，罗里慢慢地起来，摸索着回家的路。

              Part 3

              讲完这部分故事，作家停下来跟听众道谢。

              “欲知后事，你们必须得买书了。”

            现场读者掌声雷动。

            这的的确确是个精彩的故事。

            罗里会做出怎样的选择，老人当年和妻子的故事是否就这样无疾而终。

            沙龙结束后，一个年轻漂亮的女孩跟作家搭讪。

            两个人情投意合，一起回到了作家的公寓。

            美酒倒入杯中，美人近在眼前。

            这时，女孩问作家，“书里后来发生了什么？”

            作家想了想说——

            而后来发生了什么，讲到这里，我们今天的剧透份额就结束了

            这部电影的名字就叫《妙笔生花》。

            由三个故事层层嵌套，非常引人入胜。

            只有当你拨开最后一层才能得知故事的真相，而真相又十分耐人寻味。

            最后如果你喜欢这个故事，想知道结局，后台回复电影片名“妙笔生花”汁源叔已备好。

            好了，今天的晚安故事你们喜欢吗？

            「晚安」

            WeChat：home722402| Weibo：@宇宙无敌猜火车

            猜火车

            让 世 界 听 到 我 们 的 声 音

            长按二维码☝️识别关


            </div>
        </swiper-slide>
        
      </swiper>
  </div>
</template>

<script>
    import 'swiper/dist/css/swiper.css' 
    import { swiper, swiperSlide } from 'vue-awesome-swiper'
    export default {
        data() {
            return {
                swiperOption:{
                    direction:'vertical',//轮播方向
                    slidesPerView: 'auto',//同屏页数
                    freeMode:true,//自由滑动，(默认是1，表示每次只能滑动一个页面)
                    mousewheel:true,//鼠标也可以控制滑动
                }
            }
        },
        components:{swiper,swiperSlide}
    }
</script>

<style scoped>
  .swiper{
      height: 300px;
      overflow: hidden;
  }
  .text{
      font-size: 18px !important;
      text-align: left;
      padding:30px;
      height: auto;
      -webkit-box-sizing: border-box;
      box-sizing: border-box;
   
  }
</style>